examples/OpenFOAM/pipe_with_recirc_3d/scalar_transport/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "804";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
263065
(
1.10085e-05
-6.57002e-06
0.000112494
-0.000115835
-1.09772e-06
2.32107e-05
4.71955e-05
0.00018671
...
)
;

boundaryField
{
    top_and_bottom
    {
        type            calculated;
        value           uniform 0;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
480
(
-7.73037e-06
-2.20018e-05
-3.46875e-05
-4.57876e-05
-5.53018e-05
-6.32304e-05
-6.95733e-05
-7.43304e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
480
(
0.00268
0.00679581
0.0103294
0.0134543
0.016134
0.0183658
0.0201484
0.0214852
...
)
;
    }
}


// ************************************************************************* //
